cf/InformationRegisters/CertificatesStorage.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>CertificatesStorage</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Description</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>StartDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>EndDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Thumbprint</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>SerialNumber</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Certificate</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>StoreType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CertificatesStorageType</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Id</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/InformationRegisters/CertificatesStorage/Forms/ListForm/Ext/Form/Module.bsl
#Region FormCommandsEventHandlers

#Region ExportCertificate

&AtClient
Procedure ExportCertificate(Command)
	
	CurrentRecord = Items.List.CurrentRow;
	If CurrentRecord <> Undefined Then
		CurrentData = Items.List.CurrentData;
		If CurrentData <> Undefined Then
			CertificateFileName = CurrentData.Description + ".cer";
		Else
			CertificateFileName = "Certificate.cer";
		EndIf;
		Notification = New NotifyDescription("UploadCertificateAfterSearch", 
			ThisObject, New Structure("FileName", CertificateFileName));
		CertificatesStorageClient.FindCertificate(Notification, New Structure("Thumbprint", CurrentData.Thumbprint));
	EndIf;
	
EndProcedure

&AtClient
Procedure UploadCertificateAfterSearch(Result, IncomingContext) Export
	
	If Result.Completed2 And ValueIsFilled(Result.Certificate) Then
		GetFile(PutToTempStorage(Result.Certificate.Certificate), 
			IncomingContext.FileName, True);
	EndIf;
	
EndProcedure

#EndRegion

#Region ImportCertificate

&AtClient
Procedure ImportCertificate(Command)
	
	ToolTipText = NStr("ru = 'Укажите тип хранилища';
							|en = 'Specify store type';");
	NotifyDescription = New NotifyDescription("DownloadCertificateAfterSelectingStorageType", ThisObject);
	ShowInputValue(NotifyDescription, , ToolTipText, Type("EnumRef.CertificatesStorageType"));
	
EndProcedure

&AtClient
Procedure DownloadCertificateAfterSelectingStorageType(StoreType, AdditionalParameters) Export
	
	If StoreType <> Undefined Then
		NotifyDescription = New NotifyDescription("DownloadCertificateAfterPlacingFile", ThisObject, StoreType);
		BeginPutFile(NotifyDescription,,, True, UUID);
	EndIf;
	
EndProcedure

&AtClient
Procedure DownloadCertificateAfterPlacingFile(Result, CertificateAddress, SelectedFileName, StoreType) Export
	
	If Result Then
		Notification = New NotifyDescription("DownloadCertificateAfterAddingItToRepository", ThisObject);
		CertificatesStorageClient.Add(Notification, CertificateAddress, StoreType);
	EndIf;
	
EndProcedure

&AtClient
Procedure DownloadCertificateAfterAddingItToRepository(Result, IncomingContext) Export

	If Result.Completed2 Then
		Items.List.Refresh();
	ElsIf Result.Property("ErrorInfo") Then 
		ShowMessageBox(, ErrorProcessing.BriefErrorDescription(Result.ErrorInfo));		
	EndIf;
	
EndProcedure

#EndRegion

#EndRegion
